DDC-NDRS/zephyr_hal_nxp/dts/nxp/s32/S32K358-172MQFP-pinctrl.h
/* LPUART0 */
#define PTA0_LPUART0_CTS                NXP_SIUL2_PINMUX(0, 0, 0, 0, 360, 1)
#define PTA1_LPUART0_RTS                NXP_SIUL2_PINMUX(0, 0, 1, 3, 0, 0)
#define PTA2_LPUART0_RX                 NXP_SIUL2_PINMUX(0, 0, 2, 0, 187, 1)
#define PTA3_LPUART0_TX_O               NXP_SIUL2_PINMUX(0, 0, 3, 6, 0, 0)
#define PTA3_LPUART0_TX_I               NXP_SIUL2_PINMUX(0, 0, 3, 0, 363, 1)
/* PTA27 N/A */
#define PTA28_LPUART0_RX                NXP_SIUL2_PINMUX(0, 0, 28, 0, 187, 4)
#define PTB0_LPUART0_RX                 NXP_SIUL2_PINMUX(0, 0, 32, 0, 187, 2)
#define PTB1_LPUART0_TX_O               NXP_SIUL2_PINMUX(0, 0, 33, 2, 0, 0)
#define PTB1_LPUART0_TX_I               NXP_SIUL2_PINMUX(0, 0, 33, 0, 363, 2)
#define PTC2_LPUART0_RX                 NXP_SIUL2_PINMUX(0, 0, 66, 0, 187, 3)
#define PTC3_LPUART0_TX_O               NXP_SIUL2_PINMUX(0, 0, 67, 4, 0, 0)
#define PTC3_LPUART0_TX_I               NXP_SIUL2_PINMUX(0, 0, 67, 0, 363, 3)
#define PTC8_LPUART0_CTS                NXP_SIUL2_PINMUX(0, 0, 72, 0, 360, 2)
#define PTC9_LPUART0_RTS                NXP_SIUL2_PINMUX(0, 0, 73, 3, 0, 0)

/* FCCU */
#define PTA2_FCCU_ERR0                  NXP_SIUL2_PINMUX(0, 0, 2, 1, 0, 0)
#define PTA2_FCCU_ERR_IN0               NXP_SIUL2_PINMUX(0, 0, 2, 0, 148, 1)
#define PTA3_FCCU_ERR1                  NXP_SIUL2_PINMUX(0, 0, 3, 1, 0, 0)
#define PTA3_FCCU_ERR_IN1               NXP_SIUL2_PINMUX(0, 0, 3, 0, 149, 1)
#define PTE15_FCCU_ERR0                 NXP_SIUL2_PINMUX(0, 0, 143, 1, 0, 0)
#define PTE15_FCCU_ERR_IN0              NXP_SIUL2_PINMUX(0, 0, 143, 0, 148, 2)
#define PTE16_FCCU_ERR1                 NXP_SIUL2_PINMUX(0, 0, 144, 1, 0, 0)
#define PTE16_FCCU_ERR_IN1              NXP_SIUL2_PINMUX(0, 0, 144, 0, 149, 2)

/* LPSPI5 */
#define PTA2_LPSPI5_SIN_O               NXP_SIUL2_PINMUX(0, 0, 2, 7, 0, 0)
#define PTA2_LPSPI5_SIN_I               NXP_SIUL2_PINMUX(0, 0, 2, 0, 267, 2)
#define PTA3_LPSPI5_SCK_O               NXP_SIUL2_PINMUX(0, 0, 3, 7, 0, 0)
#define PTA3_LPSPI5_SCK_I               NXP_SIUL2_PINMUX(0, 0, 3, 0, 266, 2)
#define PTA14_LPSPI5_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 14, 7, 0, 0)
#define PTA14_LPSPI5_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 14, 0, 263, 2)
#define PTA15_LPSPI5_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 15, 6, 0, 0)
#define PTA15_LPSPI5_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 15, 0, 262, 3)
#define PTD2_LPSPI5_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 98, 7, 0, 0)
#define PTD2_LPSPI5_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 98, 0, 268, 2)
#define PTD4_LPSPI5_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 100, 7, 0, 0)
#define PTD4_LPSPI5_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 100, 0, 262, 2)
#define PTD13_LPSPI5_SIN_O              NXP_SIUL2_PINMUX(0, 0, 109, 1, 0, 0)
#define PTD13_LPSPI5_SIN_I              NXP_SIUL2_PINMUX(0, 0, 109, 0, 267, 1)
#define PTD14_LPSPI5_SCK_O              NXP_SIUL2_PINMUX(0, 0, 110, 1, 0, 0)
#define PTD14_LPSPI5_SCK_I              NXP_SIUL2_PINMUX(0, 0, 110, 0, 266, 1)
#define PTD17_LPSPI5_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 113, 1, 0, 0)
#define PTD17_LPSPI5_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 113, 0, 262, 1)
#define PTD26_LPSPI5_SCK_O              NXP_SIUL2_PINMUX(0, 0, 122, 6, 0, 0)
#define PTD26_LPSPI5_SCK_I              NXP_SIUL2_PINMUX(0, 0, 122, 0, 266, 3)
#define PTD27_LPSPI5_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 123, 6, 0, 0)
#define PTD27_LPSPI5_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 123, 0, 268, 3)
#define PTD28_LPSPI5_SIN_O              NXP_SIUL2_PINMUX(0, 0, 124, 6, 0, 0)
#define PTD28_LPSPI5_SIN_I              NXP_SIUL2_PINMUX(0, 0, 124, 0, 267, 3)
#define PTD29_LPSPI5_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 125, 6, 0, 0)
#define PTD29_LPSPI5_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 125, 0, 264, 1)
#define PTD30_LPSPI5_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 126, 6, 0, 0)
#define PTD30_LPSPI5_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 126, 0, 265, 1)
#define PTE8_LPSPI5_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 136, 3, 0, 0)
#define PTE8_LPSPI5_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 136, 0, 263, 1)
/* PTE9 N/A */

/* LPSPI1 */
#define PTA2_LPSPI1_SIN                 NXP_SIUL2_PINMUX(0, 0, 2, 0, 239, 2)
#define PTA3_LPSPI1_SCK_O               NXP_SIUL2_PINMUX(0, 0, 3, 3, 0, 0)
#define PTA3_LPSPI1_SCK_I               NXP_SIUL2_PINMUX(0, 0, 3, 0, 238, 1)
#define PTA6_LPSPI1_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 6, 3, 0, 0)
#define PTA6_LPSPI1_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 6, 0, 233, 1)
#define PTA11_LPSPI1_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 11, 6, 0, 0)
#define PTA11_LPSPI1_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 11, 0, 232, 2)
#define PTA12_LPSPI1_PCS5_O             NXP_SIUL2_PINMUX(0, 0, 12, 1, 0, 0)
#define PTA12_LPSPI1_PCS5_I             NXP_SIUL2_PINMUX(0, 0, 12, 0, 237, 1)
#define PTA13_LPSPI1_PCS4_O             NXP_SIUL2_PINMUX(0, 0, 13, 1, 0, 0)
#define PTA13_LPSPI1_PCS4_I             NXP_SIUL2_PINMUX(0, 0, 13, 0, 236, 1)
#define PTA14_LPSPI1_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 14, 3, 0, 0)
#define PTA14_LPSPI1_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 14, 0, 235, 2)
#define PTA16_LPSPI1_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 16, 3, 0, 0)
#define PTA16_LPSPI1_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 16, 0, 234, 2)
#define PTA18_LPSPI1_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 18, 4, 0, 0)
#define PTA18_LPSPI1_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 18, 0, 240, 4)
#define PTA19_LPSPI1_SCK_O              NXP_SIUL2_PINMUX(0, 0, 19, 4, 0, 0)
#define PTA19_LPSPI1_SCK_I              NXP_SIUL2_PINMUX(0, 0, 19, 0, 238, 3)
#define PTA20_LPSPI1_SIN_O              NXP_SIUL2_PINMUX(0, 0, 20, 4, 0, 0)
#define PTA20_LPSPI1_SIN_I              NXP_SIUL2_PINMUX(0, 0, 20, 0, 239, 3)
#define PTA21_LPSPI1_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 21, 4, 0, 0)
#define PTA21_LPSPI1_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 21, 0, 232, 3)
#define PTA28_LPSPI1_SCK_O              NXP_SIUL2_PINMUX(0, 0, 28, 3, 0, 0)
#define PTA28_LPSPI1_SCK_I              NXP_SIUL2_PINMUX(0, 0, 28, 0, 238, 4)
#define PTA29_LPSPI1_SIN_O              NXP_SIUL2_PINMUX(0, 0, 29, 5, 0, 0)
#define PTA29_LPSPI1_SIN_I              NXP_SIUL2_PINMUX(0, 0, 29, 0, 239, 4)
#define PTA30_LPSPI1_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 30, 3, 0, 0)
#define PTA30_LPSPI1_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 30, 0, 240, 5)
#define PTB14_LPSPI1_SCK_O              NXP_SIUL2_PINMUX(0, 0, 46, 3, 0, 0)
#define PTB14_LPSPI1_SCK_I              NXP_SIUL2_PINMUX(0, 0, 46, 0, 238, 2)
#define PTB15_LPSPI1_SIN_O              NXP_SIUL2_PINMUX(0, 0, 47, 3, 0, 0)
#define PTB15_LPSPI1_SIN_I              NXP_SIUL2_PINMUX(0, 0, 47, 0, 239, 1)
#define PTB16_LPSPI1_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 48, 3, 0, 0)
#define PTB16_LPSPI1_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 48, 0, 240, 2)
#define PTB17_LPSPI1_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 49, 3, 0, 0)
#define PTB17_LPSPI1_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 49, 0, 235, 1)
#define PTB18_LPSPI1_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 50, 4, 0, 0)
#define PTB18_LPSPI1_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 50, 0, 233, 2)
#define PTC6_LPSPI1_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 70, 3, 0, 0)
#define PTC6_LPSPI1_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 70, 0, 233, 4)
#define PTD2_LPSPI1_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 98, 3, 0, 0)
#define PTD2_LPSPI1_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 98, 0, 240, 1)
#define PTD3_LPSPI1_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 99, 3, 0, 0)
#define PTD3_LPSPI1_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 99, 0, 232, 1)
#define PTD4_LPSPI1_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 100, 3, 0, 0)
#define PTD4_LPSPI1_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 100, 0, 233, 6)
#define PTD20_LPSPI1_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 116, 5, 0, 0)
#define PTD20_LPSPI1_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 116, 0, 234, 1)
#define PTE4_LPSPI1_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 132, 2, 0, 0)
#define PTE4_LPSPI1_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 132, 0, 233, 5)

/* CMP0 */
#define PTA4_CMP0_OUT                   NXP_SIUL2_PINMUX(0, 0, 4, 4, 0, 0)
#define PTA11_CMP0_RRT                  NXP_SIUL2_PINMUX(0, 0, 11, 5, 0, 0)
#define PTD14_CMP0_RRT                  NXP_SIUL2_PINMUX(0, 0, 110, 6, 0, 0)
/* PTE3 N/A */

/* JTAG */
#define PTA4_JTAG_TMSSWD_DIO_O          NXP_SIUL2_PINMUX(0, 0, 4, 7, 0, 0)
#define PTA4_JTAG_TMSSWD_DIO_I          NXP_SIUL2_PINMUX(0, 0, 4, 0, 186, 0)
#define PTC4_JTAG_TCKSWD_CLK            NXP_SIUL2_PINMUX(0, 0, 68, 0, 184, 0)
#define PTC5_JTAG_TDI                   NXP_SIUL2_PINMUX(0, 0, 69, 0, 185, 0)

